:PROPERTIES:
:ID:       fba29882-1e9f-473f-a128-a2cb7a162a51
:END:
#+title: Org-Mode

* Tutorial
** Org-agenda

View that aggregate all of the todo lists and scheduled item for easier management. =SPC a o o=. However, nothing will show unless it has been scheduled.
This is done
Selecting the date is done by using =org-schedule= command  =, d s=
Once the menu is up use =S+<arrow-keys>= to move around the calendar

There is also a monthly and yearly view (y)

** Links/Hyperlinks
Follows this pattern: =[[LINK][DESCRIPTION]]= 
*** Shortcuts
  Toggle links: =,Tl=
*** References
- https://orgmode.org/guide/Hyperlinks.html

** Org-babel (Code blocks)
Both = and ~ are used to denote inline code in Org mode.
The difference is that text within = is interpreted verbatim (special characters are not interpreted),
while text within ~ is interpreted as code (special characters like backslashes are interpreted).

- =print("Hello, World!\t")=
- ~print("Hello, World!\t")~

Emacs is much more powerful than markdown and not only can you display a code block with code highlighting but also run it using =C-c C-C= while on the code block
Or course, ensure that after the begin_src block you specify the language.

# use return statement
# Entire source block will get indented and used as the body of main()
#+begin_src python
def foo(x):
  if x>0:
    return x+1

  else:
    return x-1

return foo(5)
#+end_src

#+RESULTS:
: 6

*** References
- [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html]]

** TODOS
To create a simpple TODO =C-c C-t=

** Checkboxes 

*** References
- https://orgmode.org/manual/Checkboxes.html

** Org Tags
To create a tag =C-c C-q=
*** References
- https://orgmode.org/manual/Tags.html
https://orgmode.org/manual/Tags.html

** Creating timestamps
To create a timestamp =C-c .=
*** references
- https://orgmode.org/manual/Creating-Timestamps.html
** Repeating tasks
To create a repeating task
Create a timestamp then you can add a repeating pattern using <date+n(d/w/m/y)>
#+begin_example
Learn more about emacs + programming <2024-01-19 Fri+2w> 
#+end_example

** Org-deadline

To create a deadline =C-c C-d= 
#+begin_example
*** write article about the Earth for the Guide
    DEADLINE: <2004-02-29 Sun>
    The editor in charge is [[bbdb:Ford Prefect]]
#+end_example

*** References
- https://orgmode.org/manual/Deadlines-and-Scheduling.html

** Org-schedule
Similar to deadline =C-c C-s= 
